Observações: Quantidade de camadas para max pooling reduzidas (uma a cada duas convolucionais). 
Adicionadas 5 camadas convolucionais de tamanho 40. Adicionadas fully connected layers nas saídas 
de detecção e classificação (um número menor de camadas do que o utilizado no Teste 3). Múltiplas 
saídas com a parte convolucional da rede sendo compartilhada por todas.					
					
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 12800, 1)     0
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 12792, 60)    600         input_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 12792, 60)    0           conv1d_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 12784, 40)    21640       leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 12784, 40)    0           conv1d_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3196, 40)     0           leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 3188, 40)     14440       max_pooling1d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 3188, 40)     0           conv1d_3[0][0]
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 3180, 40)     14440       leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 3180, 40)     0           conv1d_4[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 795, 40)      0           leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 787, 40)      14440       max_pooling1d_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 787, 40)      0           conv1d_5[0][0]
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 779, 40)      14440       leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 779, 40)      0           conv1d_6[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 194, 40)      0           leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 186, 40)      14440       max_pooling1d_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 186, 40)      0           conv1d_7[0][0]
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 178, 40)      14440       leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 178, 40)      0           conv1d_8[0][0]
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 44, 40)       0           leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1760)         0           max_pooling1d_4[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          352200      flatten_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 300)          528300      flatten_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 200)          0           dense_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 300)          0           dense_3[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 300)          0           leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 20)           4020        dropout_1[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           17610       flatten_1[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 30)           9030        dropout_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 20)           0           dense_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 10)           0           dense_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 30)           0           dense_4[0][0]
__________________________________________________________________________________________________
detection (Dense)               (None, 1)            21          leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
type (Dense)                    (None, 2)            22          leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
classification (Dense)          (None, 26)           806         leaky_re_lu_12[0][0]
==================================================================================================
Total params: 1,020,889
Trainable params: 1,020,889
Non-trainable params: 0
__________________________________________________________________________________________________