Observações: Adicionadas uma Conv Layer de tamanho 40 e uma de tamanho 20 no fim da parte convolucional. 
Múltiplas saídas com a parte convolucional da rede sendo compartilhada por todas.					
					
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 12800, 1)     0
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 12792, 60)    600         input_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 12792, 60)    0           conv1d_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3198, 60)     0           leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 3190, 40)     21640       max_pooling1d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 3190, 40)     0           conv1d_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 797, 40)      0           leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 789, 40)      14440       max_pooling1d_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 789, 40)      0           conv1d_3[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 197, 40)      0           leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 189, 40)      14440       max_pooling1d_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 189, 40)      0           conv1d_4[0][0]
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 47, 40)       0           leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 39, 20)       7220        max_pooling1d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 39, 20)       0           conv1d_5[0][0]
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 9, 20)        0           leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 180)          0           max_pooling1d_5[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 20)           3620        flatten_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           1810        flatten_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 300)          54300       flatten_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 20)           0           dense_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 10)           0           dense_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 300)          0           dense_2[0][0]
__________________________________________________________________________________________________
detection (Dense)               (None, 1)            21          leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
type (Dense)                    (None, 2)            22          leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
classification (Dense)          (None, 26)           7826        leaky_re_lu_7[0][0]
==================================================================================================
Total params: 125,939
Trainable params: 125,939
Non-trainable params: 0
__________________________________________________________________________________________________