Observações: Adicionado mais uma conv layer no fim de tamanho 20. 
Último hidden layer alterado para 300 nós. Classificação dos eventos 
em ON e OFF. Loss function customizada baseada na utilizada pela YOLO. 
Sum Squared Error utilizando um fator multiplicador igual a 5 para 
a detecção					
					
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv1d_1 (Conv1D)            (None, 12792, 60)         600
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 12792, 60)         0
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 3198, 60)          0
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 3190, 40)          21640
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 3190, 40)          0
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 797, 40)           0
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 789, 40)           14440
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 789, 40)           0
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 197, 40)           0
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 189, 20)           7220
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 189, 20)           0
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 47, 20)            0
_________________________________________________________________
flatten_1 (Flatten)          (None, 940)               0
_________________________________________________________________
dense_1 (Dense)              (None, 300)               282300
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 300)               0
_________________________________________________________________
dense_2 (Dense)              (None, 29)                8729
=================================================================
Total params: 334,929
Trainable params: 334,929
Non-trainable params: 0
_________________________________________________________________