Observações: Múltiplas saídas com a parte convolucional da rede sendo compartilhada por todas.				

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 12800, 1)     0
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 12792, 60)    600         input_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 12792, 60)    0           conv1d_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3198, 60)     0           leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 3190, 40)     21640       max_pooling1d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 3190, 40)     0           conv1d_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 797, 40)      0           leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 789, 40)      14440       max_pooling1d_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 789, 40)      0           conv1d_3[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 197, 40)      0           leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 7880)         0           max_pooling1d_3[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 20)           157620      flatten_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           78810       flatten_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 300)          2364300     flatten_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 20)           0           dense_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 10)           0           dense_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 300)          0           dense_2[0][0]
__________________________________________________________________________________________________
detection (Dense)               (None, 1)            21          leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
type (Dense)                    (None, 2)            22          leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
classification (Dense)          (None, 26)           7826        leaky_re_lu_5[0][0]
==================================================================================================
Total params: 2,645,279
Trainable params: 2,645,279
Non-trainable params: 0
__________________________________________________________________________________________________