Observações: Kernel size de todos os conv layers modificado para 20. 
Último hidden layer alterado para 300 nós. Classificação dos eventos 
em ON e OFF. Loss function customizada baseada na utilizada pela YOLO. 
Sum Squared Error utilizando um fator multiplicador igual a 5 para a 
detecção					
					
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv1d_1 (Conv1D)            (None, 12781, 60)         1260
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 12781, 60)         0
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 3195, 60)          0
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 3176, 40)          48040
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 3176, 40)          0
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 794, 40)           0
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 775, 40)           32040
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 775, 40)           0
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 193, 40)           0
_________________________________________________________________
flatten_1 (Flatten)          (None, 7720)              0
_________________________________________________________________
dense_1 (Dense)              (None, 300)               2316300
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 300)               0
_________________________________________________________________
dense_2 (Dense)              (None, 29)                8729
=================================================================
Total params: 2,406,369
Trainable params: 2,406,369
Non-trainable params: 0
_________________________________________________________________